import { useState } from "react";

import { Link } from "react-router-dom";

import AnimatedPage from "../components/animatedPage";
import LocationRadio from "../components/locationRadio";
import EventTypeCheckbox from "../components/eventTypeCheckbox";
import FilterCollpaseExpand from "./../components/filterCollpaseExpand";

import hamyarLogo from "../assets/mvp/hamyar-logo.png";
import hamyarSpace from "../assets/mvp/hamyar-space.png";

import Wave from "./../assets/icons/wave.svg";

import "../styles/events.scss";

function Events() {
  const DEFAULTCOSTMAX = 750000;

  const [maxCost, setMaxCost] = useState<number>(DEFAULTCOSTMAX);

  const MaxCostHandler = (e: any) => {
    setMaxCost(e.target.value);
  };

  // first we need to convert maxCost to string because of split method then reverse array because we
  // seprate numbers from right to left then join charaters to together to make it ready for match method
  // in which this will seprate 3 by 3 charaters after that we need to reverse these 3 by 3 charaters
  // because these reversed in the first stage
  // in the end due to reversing cost we have to reverse it again to neutralize the first one.
  const sepratedMaxCost = maxCost
    .toString()
    .split("")
    .reverse()
    .join("")
    .match(/.{1,3}/g)
    ?.map((item) => item.toString().split("").reverse().join(""))
    ?.reverse()
    ?.join(",");

  return (
    <AnimatedPage>
      <div className="events">
        <div className="events_header">
          <span>اینجا دست خالی برنمیگردی</span>
          <h2>رویداد ها ، همایش ، کمپین های آموزشی و جشنواره ها</h2>
          <p>
            اینجا میتونی همه رویداد ها جشنواره ها و و بوت کمپ های آموزشی رو پیدا کنی و بدون دغدغه از جزئیات اونا باخبر
            بشی .
          </p>
          <img src={Wave} alt="" />
        </div>
        <div className="header_filter">
          <div className="filter_menu">
            <div className="menu_item">
              <svg width="37" height="37" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M30.0406 28.6264C29.6501 28.2359 29.0169 28.2359 28.6264 28.6264C28.2359 29.0169 28.2359 29.6501 28.6264 30.0406L30.0406 28.6264ZM35.2929 36.7072C35.6834 37.0977 36.3166 37.0977 36.7071 36.7072C37.0976 36.3167 37.0976 35.6835 36.7071 35.293L35.2929 36.7072ZM13.1861 7.09026C13.7316 7.00386 14.1038 6.49162 14.0174 5.94613C13.931 5.40065 13.4187 5.02848 12.8732 5.11488L13.1861 7.09026ZM5.11486 12.8733C5.02846 13.4187 5.40063 13.931 5.94611 14.0174C6.4916 14.1038 7.00384 13.7316 7.09024 13.1861L5.11486 12.8733ZM28.6264 30.0406L35.2929 36.7072L36.7071 35.293L30.0406 28.6264L28.6264 30.0406ZM16 30C8.26803 30 2 23.732 2 16H0C0 24.8366 7.16346 32 16 32V30ZM30.0001 16C30.0001 23.732 23.732 30 16 30V32C24.8366 32 32.0001 24.8366 32.0001 16H30.0001ZM16 1.99997C23.732 1.99997 30.0001 8.268 30.0001 16H32.0001C32.0001 7.16343 24.8366 -3.05176e-05 16 -3.05176e-05V1.99997ZM16 -3.05176e-05C7.16346 -3.05176e-05 0 7.16343 0 16H2C2 8.268 8.26803 1.99997 16 1.99997V-3.05176e-05ZM12.8732 5.11488C8.87957 5.74742 5.7474 8.87959 5.11486 12.8733L7.09024 13.1861C7.58723 10.0482 10.0482 7.58725 13.1861 7.09026L12.8732 5.11488Z"
                  fill="#DA9E03"
                />
              </svg>

              <input type="text" placeholder="دنبال چی هستی این مهمه !!" />
            </div>
            <div className="menu_seprater" />
            <div className="menu_item">
              <svg width="30" height="35" viewBox="0 0 30 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M15 1.24997C7.26801 1.24997 1 7.51798 1 15.25V15.8229C1 18.7727 1.93112 21.6305 3.63617 24H3.625L3.66523 24.0402C4.01369 24.5208 4.39412 24.9812 4.8052 25.418C5.42465 26.0762 15 33.625 15 33.625C16.3974 32.9132 24.0545 26.6295 25.1948 25.418C25.6102 24.9766 25.9942 24.5111 26.3458 24.025L26.375 24H26.3638C28.0688 21.6305 29 18.7727 29 15.8229V15.25C29 7.51798 22.732 1.24997 15 1.24997Z"
                  stroke="#DA9E03"
                  strokeWidth="2"
                  strokeLinejoin="round"
                />
                <path
                  d="M20.6875 15.25C20.6875 12.1089 18.1411 9.56247 15 9.56247C11.8589 9.56247 9.3125 12.1089 9.3125 15.25C9.3125 18.3911 11.8589 20.9375 15 20.9375C18.1411 20.9375 20.6875 18.3911 20.6875 15.25Z"
                  stroke="#DA9E03"
                  strokeWidth="2"
                />
              </svg>

              <select>
                <option value="" disabled selected>
                  کجا باشه خوبه ؟
                </option>
                <option value="">اصفهان</option>
                <option value="">تهران</option>
                <option value="">شیراز</option>
              </select>
            </div>
            <div className="menu_seprater" />
            <div className="menu_item">
              <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M15 26.5C15 27.0523 15.4477 27.5 16 27.5C16.5523 27.5 17 27.0523 17 26.5H15ZM17 5.49997C17 4.94768 16.5523 4.49997 16 4.49997C15.4477 4.49997 15 4.94768 15 5.49997H17ZM19.7648 10.6151C20.041 11.0934 20.6526 11.2573 21.1309 10.9811C21.6092 10.705 21.773 10.0934 21.4969 9.61509L19.7648 10.6151ZM20.0675 9.13935L19.2015 9.63935V9.63935L20.0675 9.13935ZM14.6951 15.5199L15.0403 14.5814L15.0403 14.5814L14.6951 15.5199ZM17.3052 16.48L17.6504 15.5415L17.6504 15.5415L17.3052 16.48ZM11.9328 22.8606L11.0668 23.3606H11.0668L11.9328 22.8606ZM12.2355 21.3849C11.9593 20.9066 11.3477 20.7427 10.8695 21.0188C10.3912 21.295 10.2273 21.9066 10.5034 22.3849L12.2355 21.3849ZM17.9918 24.4841L17.4918 23.6181L17.9918 24.4841ZM14.0085 7.51584L14.5085 8.38187H14.5085L14.0085 7.51584ZM30 16C30 23.732 23.732 30 16 30V32C24.8366 32 32 24.8365 32 16H30ZM16 30C8.26801 30 2 23.732 2 16H0C0 24.8365 7.16344 32 16 32V30ZM2 16C2 8.26798 8.26801 1.99997 16 1.99997V-3.05176e-05C7.16344 -3.05176e-05 0 7.16341 0 16H2ZM16 1.99997C23.732 1.99997 30 8.26798 30 16H32C32 7.16341 24.8366 -3.05176e-05 16 -3.05176e-05V1.99997ZM21.4969 9.61509L20.9336 8.63935L19.2015 9.63935L19.7648 10.6151L21.4969 9.61509ZM12.7988 22.3606L12.2355 21.3849L10.5034 22.3849L11.0668 23.3606L12.7988 22.3606ZM16.96 17.4185C19.6937 18.424 20.0143 22.1617 17.4918 23.6181L18.4918 25.3501C22.4828 23.0459 21.9756 17.1323 17.6504 15.5415L16.96 17.4185ZM13.5085 6.64982C9.51749 8.95403 10.0248 14.8676 14.3499 16.4585L15.0403 14.5814C12.3066 13.5759 11.986 9.83824 14.5085 8.38187L13.5085 6.64982ZM17 26.5V25.0735H15V26.5H17ZM17 25.0735V16H15V25.0735H17ZM17.4918 23.6181C17.0023 23.9007 16.475 24.0484 15.9499 24.0748L16.0501 26.0723C16.8846 26.0304 17.7214 25.7949 18.4918 25.3501L17.4918 23.6181ZM15.9499 24.0748C14.7005 24.1375 13.4651 23.5146 12.7988 22.3606L11.0668 23.3606C12.1228 25.1896 14.0805 26.1711 16.0501 26.0723L15.9499 24.0748ZM14.3499 16.4585L15.6548 16.9385L16.3452 15.0615L15.0403 14.5814L14.3499 16.4585ZM15.6548 16.9385L16.9601 17.4185L17.6504 15.5415L16.3452 15.0614L15.6548 16.9385ZM17 16L17 6.92643H15L15 16H17ZM17 6.92643V5.49997H15V6.92643H17ZM20.9336 8.63935C19.8775 6.8102 17.9195 5.82871 15.9498 5.92769L16.0502 7.92517C17.2997 7.86238 18.5352 8.48526 19.2015 9.63935L20.9336 8.63935ZM15.9498 5.92769C15.1155 5.96962 14.2788 6.20508 13.5085 6.64982L14.5085 8.38187C14.9979 8.09931 15.5252 7.95155 16.0502 7.92517L15.9498 5.92769Z"
                  fill="#DA9E03"
                />
              </svg>

              <select>
                <option value="">قیمتش چند باشه ؟</option>
                <option value="">اصفهان</option>
                <option value="">تهران</option>
                <option value="">شیراز</option>
              </select>
            </div>
            <button>جستجو</button>
          </div>
        </div>
        <div className="events_filterbar">
          <h3>فیلتر نتایج براساس</h3>
          <div className="filterbar__list">
            <button>دورهمی</button>
            <button>رویداد</button>
            <button>همایش</button>
            <button>جشنواره ها</button>
          </div>
        </div>
        <main>
          <aside className="sidebar upAndDownBadges">
            <form
              onChange={(e) => {
                e.preventDefault();
              }}
            >
              <div className="filter_header">
                <h5>فیلتر</h5>
                <button
                  className="filter_reset"
                  type="reset"
                  onClick={() => {
                    setMaxCost(DEFAULTCOSTMAX);
                  }}
                >
                  ریست
                </button>
              </div>
              <FilterCollpaseExpand title="قیمت">
                <div className="cost_container">
                  <input
                    type="range"
                    min="0"
                    max="1000000"
                    defaultValue={DEFAULTCOSTMAX}
                    onChange={MaxCostHandler}
                    style={{
                      background: `linear-gradient(90deg, #8D56C3 ${(maxCost * 100) / 1000000}%, #8D56C380 ${
                        (maxCost * 100) / 1000000
                      }%)`,
                    }}
                  />
                  <div className="cost_count">{maxCost === 0 ? "رایگان" : `حداکثر تا ${sepratedMaxCost} تومان`}</div>
                </div>
              </FilterCollpaseExpand>
              <FilterCollpaseExpand title="مکان">
                <div className="location_container">
                  <div className="location_item">
                    <input type="radio" id={"تهران"} value={"تهران"} name={"location_filter"} defaultChecked />
                    <label htmlFor={"تهران"}>تهران</label>
                  </div>
                  <LocationRadio title="اصفهان" />
                  <LocationRadio title="یزد" />
                  <LocationRadio title="اصفهان" />
                  <LocationRadio title="یزد" />
                  <LocationRadio title="اصفهان" />
                  <LocationRadio title="یزد" />
                  <LocationRadio title="اصفهان" />
                  <LocationRadio title="یزد" />
                  <LocationRadio title="اصفهان" />
                  <LocationRadio title="یزد" />
                  <LocationRadio title="اصفهان" />
                  <LocationRadio title="یزد" />
                  <LocationRadio title="اصفهان" />
                  <LocationRadio title="یزد" />
                  <LocationRadio title="اصفهان" />
                  <LocationRadio title="یزد" />
                </div>
              </FilterCollpaseExpand>
              <FilterCollpaseExpand title="نوع مراسم">
                <div className="type_container">
                  <div className="type_item">
                    <input type="checkbox" id={"جشنواره"} value={"جشنواره"} name={"event_type_filter"} defaultChecked />
                    <label htmlFor={"جشنواره"}>جشنواره</label>
                  </div>
                  <EventTypeCheckbox title="رویداد" />
                  <EventTypeCheckbox title="بوت کمپ آموزشی" />
                  <EventTypeCheckbox title="دورهمی" />
                  <a href="">دیدن همه</a>
                </div>
              </FilterCollpaseExpand>
            </form>
          </aside>
          <section>
            <div className="banner">
              <div className="banner_logo">
                <img src={hamyarLogo} alt="" />
              </div>
              <div className="banner_content">
                <a>رویداد رفرش کانف دورهمی برنامه نویسان بک اند</a>
                <h4>
                  مکان
                  {/* <img src={LocationIcon} alt="" /> */}
                  <span>اصفهان چهارباغ نبش مسجد جامع سالن همایش قیاصی </span>
                </h4>
                <div className="content_details">
                  <div className="details_cost">
                    <span>1،500,000 </span> تومان
                  </div>
                  <div className="capacity">
                    <span style={{ color: 3 < 10 ? "red" : undefined }}>3</span> نفر تا تکمیل ظرفیت
                  </div>
                </div>
              </div>
              <div className="banner_spaces">
                {Array.apply(0, new Array(4))
                  .slice(0, 3)
                  .map((item, index) => (
                    <button>
                      <img src={hamyarSpace} alt="" key={index} />
                    </button>
                  ))}
                {Array.apply(0, new Array(5)).length > 3 ? (
                  <button className="spaces_more">
                    <img src={hamyarSpace} alt="" />
                    <div className="more_count">
                      <span>3</span>+
                    </div>
                  </button>
                ) : (
                  "df"
                )}
              </div>
              <div className="banner_timer">
                <svg width="16" height="17" viewBox="0 0 16 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M8.5 5.725C8.5 5.44886 8.27614 5.225 8 5.225C7.72386 5.225 7.5 5.44886 7.5 5.725H8.5ZM10.1 9.725C10.3761 9.725 10.6 9.50114 10.6 9.225C10.6 8.94886 10.3761 8.725 10.1 8.725V9.725ZM1.38765 2.00957C1.17202 2.18207 1.13706 2.49672 1.30957 2.71235C1.48207 2.92798 1.79672 2.96294 2.01235 2.79043L1.38765 2.00957ZM3.76235 1.39043C3.97798 1.21793 4.01294 0.903283 3.84043 0.687652C3.66793 0.472022 3.35328 0.437061 3.13765 0.609566L3.76235 1.39043ZM13.9877 2.79043C14.2033 2.96294 14.5179 2.92798 14.6904 2.71235C14.8629 2.49672 14.828 2.18207 14.6123 2.00957L13.9877 2.79043ZM12.8623 0.609566C12.6467 0.437061 12.3321 0.472022 12.1596 0.687652C11.9871 0.903283 12.022 1.21793 12.2377 1.39043L12.8623 0.609566ZM8 8.175H7.5H8ZM7.5 5.725L7.5 8.175H8.5L8.5 5.725H7.5ZM14.5 8.525C14.5 12.1149 11.5899 15.025 8 15.025V16.025C12.1421 16.025 15.5 12.6671 15.5 8.525H14.5ZM8 15.025C4.41015 15.025 1.5 12.1149 1.5 8.525H0.5C0.5 12.6671 3.85786 16.025 8 16.025V15.025ZM1.5 8.525C1.5 4.93515 4.41015 2.025 8 2.025V1.025C3.85786 1.025 0.5 4.38286 0.5 8.525H1.5ZM8 2.025C11.5899 2.025 14.5 4.93515 14.5 8.525H15.5C15.5 4.38286 12.1421 1.025 8 1.025V2.025ZM2.01235 2.79043L3.76235 1.39043L3.13765 0.609566L1.38765 2.00957L2.01235 2.79043ZM14.6123 2.00957L12.8623 0.609566L12.2377 1.39043L13.9877 2.79043L14.6123 2.00957ZM9.05 9.725H10.1V8.725H9.05V9.725ZM7.5 8.175C7.5 9.03104 8.19396 9.725 9.05 9.725V8.725C8.74624 8.725 8.5 8.47876 8.5 8.175H7.5Z"
                    fill="white"
                  />
                </svg>

                <time>
                  <span>03 </span>: <span>07 </span>: <span>15 </span>
                </time>
              </div>
              <button className="redirect_button">
                <svg width="18" height="9" viewBox="0 0 18 9" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M17.939 4.50001C17.939 4.16833 17.6567 3.89944 17.3084 3.89944L8.69129 3.89944L8.69129 2.20612C8.69129 0.378759 6.48935 -0.65349 4.9691 0.461193L1.84063 2.75507C0.638408 3.63656 0.63841 5.36344 1.84063 6.24493L4.96911 8.53881C6.48936 9.65349 8.69129 8.62124 8.69129 6.79387L8.69129 5.10057L17.3084 5.10057C17.6567 5.10057 17.939 4.83169 17.939 4.50001Z"
                    fill="#DA9E03"
                  />
                </svg>
              </button>
            </div>
            <div className="filter_header">
              <div>
                <span>فیلتر براساس</span>
                <select>
                  <option value="rate">امتیاز</option>
                  <option value="date">زمان</option>
                  <option value="cost">قیمت</option>
                </select>
              </div>
              <span className="filter_count">
                <span>100</span> آیتم توسط جستجو پیدا شد{" "}
              </span>
            </div>
            <div className="events_box">
              {Array.apply(0, new Array(5)).map(() => (
                <div className="events_box_content">
                  <div className="content__header">
                    <img src={hamyarSpace} alt="" className="header-image" />
                    <div className="header__header__container">
                      <img src={hamyarLogo} alt="" className="header-logo" />
                    </div>
                  </div>
                  <div className="caption">
                    <div className="caption__item">
                      <div className="caption__item__icon">
                        <svg width="20" height="19" viewBox="0 0 20 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path
                            fillRule="evenodd"
                            clipRule="evenodd"
                            d="M13.4435 7.99988C13.983 6.68946 12.6726 5.37903 11.3622 5.91862L8.92346 6.9228C8.30569 7.17718 7.81511 7.66776 7.56073 8.28553L6.55654 10.7243C6.01696 12.0347 7.32738 13.3451 8.63781 12.8055L11.0765 11.8013C11.6943 11.547 12.1849 11.0564 12.4393 10.4386L13.4435 7.99988ZM11.8825 7.18224C12.0697 7.10516 12.2569 7.29236 12.1798 7.47957L11.1756 9.9183C11.06 10.1991 10.837 10.4221 10.5562 10.5377L8.11749 11.5419C7.93029 11.619 7.74308 11.4318 7.82017 11.2446L8.82435 8.80585C8.93998 8.52505 9.16297 8.30205 9.44378 8.18643L11.8825 7.18224Z"
                            fill="#8D56C3"
                          />
                          <path
                            fillRule="evenodd"
                            clipRule="evenodd"
                            d="M12.7939 0.065486C12.0609 -1.00459e-05 11.1652 -5.5398e-06 10.0321 1.07618e-07H9.96792C8.83476 -5.6484e-06 7.93907 -1.02631e-05 7.20607 0.0654857C6.45314 0.132763 5.82338 0.272189 5.22818 0.577521C5.074 0.656614 4.92385 0.743308 4.77826 0.837284C4.21624 1.20007 3.78061 1.67574 3.34588 2.29417C2.92266 2.89621 2.47482 3.6719 1.90825 4.65325L1.87616 4.70882C1.30958 5.69017 0.861729 6.46585 0.551952 7.13339C0.233749 7.81909 0.0396156 8.43419 0.00644445 9.10231C-0.00214814 9.27538 -0.00214814 9.44877 0.0064444 9.62184C0.0396155 10.29 0.233749 10.9051 0.551952 11.5908C0.861726 12.2583 1.30957 13.034 1.87615 14.0153L1.90823 14.0709C2.47481 15.0522 2.92266 15.8279 3.34588 16.43C3.78061 17.0484 4.21624 17.5241 4.77826 17.8869C4.92384 17.9808 5.074 18.0675 5.22818 18.1466C5.82338 18.452 6.45313 18.5914 7.20607 18.6587C7.93905 18.7242 8.83473 18.7242 9.96786 18.7242H10.0321C11.1652 18.7242 12.0609 18.7242 12.7939 18.6587C13.5469 18.5914 14.1766 18.452 14.7718 18.1466C14.926 18.0675 15.0761 17.9808 15.2217 17.8869C15.7838 17.5241 16.2194 17.0484 16.6541 16.43C17.0773 15.8279 17.5252 15.0523 18.0917 14.0709L18.1238 14.0153C18.6904 13.034 19.1383 12.2583 19.448 11.5908C19.7663 10.9051 19.9604 10.29 19.9936 9.62184C20.0021 9.44877 20.0021 9.27538 19.9936 9.10231C19.9604 8.4342 19.7663 7.81909 19.448 7.1334C19.1383 6.46585 18.6904 5.69016 18.1238 4.70881L18.0917 4.6532C17.5252 3.67187 17.0773 2.8962 16.6541 2.29417C16.2194 1.67575 15.7838 1.20007 15.2217 0.837284C15.0762 0.743309 14.926 0.656615 14.7718 0.577522C14.1766 0.272189 13.5469 0.132763 12.7939 0.065486ZM5.85193 1.79342C6.23568 1.59656 6.67556 1.48489 7.32769 1.42662C7.99286 1.36718 8.82769 1.36656 10 1.36656C11.1723 1.36656 12.0071 1.36718 12.6723 1.42662C13.3244 1.48489 13.7643 1.59656 14.1481 1.79342C14.262 1.85188 14.373 1.91596 14.4806 1.98542C14.843 2.21932 15.1596 2.54443 15.5362 3.08006C15.9202 3.6264 16.3382 4.34906 16.9243 5.36432C17.5105 6.37957 17.9273 7.10287 18.2085 7.70863C18.4841 8.30254 18.6073 8.73932 18.6287 9.17008C18.635 9.298 18.635 9.42616 18.6287 9.55408C18.6073 9.98484 18.4841 10.4216 18.2085 11.0155C17.9273 11.6213 17.5105 12.3446 16.9243 13.3598C16.3382 14.3751 15.9202 15.0978 15.5362 15.6441C15.1596 16.1797 14.843 16.5048 14.4806 16.7387C14.373 16.8082 14.262 16.8723 14.1481 16.9307C13.7643 17.1276 13.3244 17.2393 12.6723 17.2975C12.0071 17.357 11.1723 17.3576 10 17.3576C8.82769 17.3576 7.99286 17.357 7.32769 17.2975C6.67556 17.2393 6.23568 17.1276 5.85193 16.9307C5.73798 16.8723 5.62699 16.8082 5.51938 16.7387C5.15703 16.5048 4.84038 16.1797 4.46385 15.6441C4.07979 15.0978 3.66183 14.3751 3.07568 13.3598C2.48952 12.3446 2.07265 11.6213 1.79154 11.0155C1.51594 10.4216 1.39271 9.98484 1.37132 9.55407C1.36497 9.42615 1.36497 9.298 1.37132 9.17008C1.39271 8.73931 1.51594 8.30254 1.79154 7.70863C2.07265 7.10286 2.48952 6.37957 3.07568 5.36432C3.66183 4.34906 4.07979 3.6264 4.46385 3.08006C4.84038 2.54443 5.15703 2.21932 5.51938 1.98542C5.62699 1.91596 5.73798 1.85188 5.85193 1.79342Z"
                            fill="#8D56C3"
                          />
                        </svg>
                      </div>
                      <span>جشنوا جشنواره توسعه دهندگان </span>
                    </div>
                    <div className="caption__item">
                      <div className="caption__item__icon">
                        <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path
                            d="M10.25 18C10.25 18.4142 10.5858 18.75 11 18.75C11.4142 18.75 11.75 18.4142 11.75 18H10.25ZM11.75 4C11.75 3.58579 11.4142 3.25 11 3.25C10.5858 3.25 10.25 3.58579 10.25 4H11.75ZM13.4377 7.45175C13.6448 7.81047 14.1035 7.93338 14.4623 7.72627C14.821 7.51916 14.9439 7.06047 14.7368 6.70175L13.4377 7.45175ZM13.7117 6.42625L13.0622 6.80125V6.80125L13.7117 6.42625ZM10.1301 10.68L10.389 9.9761L10.389 9.97609L10.1301 10.68ZM11.8702 11.32L12.1291 10.6161L12.129 10.6161L11.8702 11.32ZM8.28853 15.5738L7.63901 15.9488H7.63902L8.28853 15.5738ZM8.56249 14.5483C8.35538 14.1895 7.89669 14.0666 7.53797 14.2737C7.17925 14.4808 7.05634 14.9395 7.26345 15.2983L8.56249 14.5483ZM12.3279 16.6561L11.9529 16.0066L12.3279 16.6561ZM9.67234 5.34391L10.0473 5.99343L9.67234 5.34391ZM20.25 11C20.25 16.1086 16.1086 20.25 11 20.25V21.75C16.9371 21.75 21.75 16.9371 21.75 11H20.25ZM11 20.25C5.89137 20.25 1.75 16.1086 1.75 11H0.25C0.25 16.9371 5.06294 21.75 11 21.75V20.25ZM1.75 11C1.75 5.89137 5.89137 1.75 11 1.75V0.25C5.06294 0.25 0.25 5.06294 0.25 11H1.75ZM11 1.75C16.1086 1.75 20.25 5.89137 20.25 11H21.75C21.75 5.06294 16.9371 0.25 11 0.25V1.75ZM14.7368 6.70175L14.3612 6.05125L13.0622 6.80125L13.4377 7.45175L14.7368 6.70175ZM8.93805 15.1988L8.56249 14.5483L7.26345 15.2983L7.63901 15.9488L8.93805 15.1988ZM11.6113 12.0239C13.3674 12.6699 13.5734 15.071 11.9529 16.0066L12.7029 17.3056C15.4247 15.7341 15.0788 11.7011 12.1291 10.6161L11.6113 12.0239ZM9.29734 4.6944C6.57547 6.26586 6.92143 10.2989 9.87116 11.3839L10.389 9.97609C8.63281 9.33015 8.42685 6.92902 10.0473 5.99343L9.29734 4.6944ZM11.75 18V17.049H10.25V18H11.75ZM11.75 17.049V11H10.25V17.049H11.75ZM11.9529 16.0066C11.6383 16.1882 11.2996 16.2831 10.9624 16.3L11.0376 17.7981C11.6068 17.7695 12.1776 17.6089 12.7029 17.3056L11.9529 16.0066ZM10.9624 16.3C10.1595 16.3403 9.36599 15.94 8.93805 15.1988L7.63902 15.9488C8.35925 17.1962 9.69453 17.8655 11.0376 17.7981L10.9624 16.3ZM9.87113 11.3839L10.7411 11.7039L11.2589 10.2961L10.389 9.9761L9.87113 11.3839ZM10.7411 11.7039L11.6113 12.0239L12.129 10.6161L11.2589 10.2961L10.7411 11.7039ZM11.75 11L11.75 4.95097H10.25L10.25 11H11.75ZM11.75 4.95097V4H10.25V4.95097H11.75ZM14.3612 6.05125C13.6409 4.80369 12.3055 4.13442 10.9624 4.20192L11.0376 5.70003C11.8406 5.65968 12.6342 6.05999 13.0622 6.80125L14.3612 6.05125ZM10.9624 4.20192C10.3933 4.23052 9.82258 4.39115 9.29734 4.6944L10.0473 5.99343C10.3619 5.81182 10.7005 5.71697 11.0376 5.70003L10.9624 4.20192Z"
                            fill="#47B044"
                          />
                        </svg>
                      </div>
                      <span>55،000 تومان</span>
                    </div>
                    <div className="caption__item">
                      <div className="caption__item__icon">
                        <svg width="18" height="23" viewBox="0 0 18 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path
                            d="M11.7808 19.7005L11.1906 19.2377L11.7808 19.7005ZM6.21921 19.7005L5.62903 20.1633L6.21921 19.7005ZM9 22.0055V21.2555V22.0055ZM16.25 9.6087C16.25 10.8352 15.6104 12.4764 14.6037 14.256C13.6137 16.0063 12.3342 17.7794 11.1906 19.2377L12.371 20.1633C13.5371 18.6762 14.8672 16.837 15.9094 14.9945C16.9349 13.1814 17.75 11.2494 17.75 9.6087H16.25ZM6.80938 19.2377C5.66578 17.7794 4.38628 16.0063 3.39625 14.256C2.38962 12.4764 1.75 10.8352 1.75 9.6087H0.25C0.25 11.2494 1.06511 13.1814 2.09064 14.9945C3.13277 16.837 4.46288 18.6762 5.62903 20.1633L6.80938 19.2377ZM1.75 9.6087C1.75 5.21571 5.04678 1.75 9 1.75V0.25C4.11666 0.25 0.25 4.49277 0.25 9.6087H1.75ZM9 1.75C12.9532 1.75 16.25 5.21571 16.25 9.6087H17.75C17.75 4.49277 13.8833 0.25 9 0.25V1.75ZM11.1906 19.2377C10.5717 20.027 10.1641 20.5426 9.79918 20.8741C9.46635 21.1764 9.24418 21.2555 9 21.2555V22.7555C9.72906 22.7555 10.2948 22.4504 10.8078 21.9844C11.2886 21.5476 11.7849 20.9107 12.371 20.1633L11.1906 19.2377ZM5.62903 20.1633C6.21511 20.9107 6.71136 21.5476 7.19224 21.9844C7.70524 22.4504 8.27094 22.7555 9 22.7555V21.2555C8.75582 21.2555 8.53365 21.1764 8.20082 20.8741C7.83587 20.5426 7.42834 20.027 6.80938 19.2377L5.62903 20.1633ZM5.25 10C5.25 12.0711 6.92893 13.75 9 13.75V12.25C7.75736 12.25 6.75 11.2426 6.75 10H5.25ZM9 13.75C11.0711 13.75 12.75 12.0711 12.75 10H11.25C11.25 11.2426 10.2426 12.25 9 12.25V13.75ZM12.75 10C12.75 7.92893 11.0711 6.25 9 6.25V7.75C10.2426 7.75 11.25 8.75736 11.25 10H12.75ZM9 6.25C6.92893 6.25 5.25 7.92893 5.25 10H6.75C6.75 8.75736 7.75736 7.75 9 7.75V6.25Z"
                            fill="#398DCB"
                          />
                        </svg>
                      </div>
                      <span>ایران ، تهران ، قم ، کاشان اصفهان</span>
                    </div>
                  </div>
                  <Link to={`/events/${"جشنواره توسعه دهندگان".replaceAll(" ", "-")}`}>
                    <div className="events_box_content__button ">
                      <button className="btn primary">مشاهده جزئیات رویداد</button>
                    </div>
                  </Link>
                </div>
              ))}
            </div>
          </section>
        </main>
      </div>
    </AnimatedPage>
  );
}

export default Events;
